read_verilog alu.v mux.v counter.v mini_soc.v

hierarchy -check -top mini_soc

proc; opt; fsm; opt; memory; opt;

techmap; opt;

dfflibmap -liberty /home/lab-user/Desktop/bootcamp-files/Tech-pdks/osu018/osu018_stdcells.lib 

abc -liberty /home/lab-user/Desktop/bootcamp-files/Tech-pdks/osu018/osu018_stdcells.lib

clean

show -format dot

write_verilog mini_soc_netlist.v
